## libraries

In [5]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

#### read csv

In [70]:
df = pd.read_csv('data.csv')
df.head(3)

  Area  Room  Parking  Warehouse  Elevator  Address         Price  Price(USD)
0   63     1     True       True      True  Shahran  1.850000e+09    61666.67
1   60     1     True       True      True  Shahran  1.850000e+09    61666.67
2   79     2     True       True      True   Pardis  5.500000e+08    18333.33

In [71]:
pshape , pdtype = df.shape , df.dtypes

### cleaning and pre processing and removing nan

In [59]:
df = df[df['Address'].notnull()] #for string
df = df[pd.to_numeric(df['Area'], errors='coerce').notnull()] #for numeric
# df['Area'] = df['Area'].astype('int') #for change type

In [60]:
df.head(3)

  Area  Room  Parking  Warehouse  Elevator  Address         Price  Price(USD)
0   63     1     True       True      True  Shahran  1.850000e+09    61666.67
1   60     1     True       True      True  Shahran  1.850000e+09    61666.67
2   79     2     True       True      True   Pardis  5.500000e+08    18333.33

In [61]:
print('previous shape:',pshape,'\t','new shape:',df.shape)
# df.shape

previous shape: (3479, 8) 	 new shape: (3450, 8)

### for searching

In [68]:
set_group = df.groupby(['Room'])
set_group.get_group(1)[:5]

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
7,59,1,True,True,True,Shahran,2.150000e+09,71666.67
9,71,1,True,True,True,West Ferdows Boulevard,2.370000e+09,79000.00
11,64,1,True,True,True,Narmak,2.100000e+09,70000.00

### normalization

In [99]:
x = df['Area'].values[:4].astype('int32')
x = x.reshape(-1,1)

In [97]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler(feature_range=(0,1))
normalized_data = scaler.fit_transform(x)

In [100]:
normalized_data

array([[0.08571429],
       [0.        ],
       [0.54285714],
       [1.        ]])

### pre processing
- convert to numpy

In [11]:
from sklearn import preprocessing

data = df[['Area','Room','Parking','Warehouse','Elevator']].values
print(data.shape)
print(data[:2])

(3450, 5)
[['63' 1 True True True]
 ['60' 1 True True True]]

In [13]:
#We must convert these Values to numerical values
park = preprocessing.LabelEncoder()
park.fit([True,False])
data[:,2] = park.transform(data[:,2]) 

war = preprocessing.LabelEncoder()
war.fit([True,False])
data[:,3] = war.transform(data[:,3]) 

ele = preprocessing.LabelEncoder()
ele.fit([True,False])
data[:,4] = ele.transform(data[:,4])

In [14]:
data[0:2]

array([['63', 1, 1, 1, 1],
       ['60', 1, 1, 1, 1]], dtype=object)

### converting np to pd

In [15]:
cell_df = pd.DataFrame(data, columns = ['Area','Room','Parking','Warehouse','Elevator'])
cell_df.head(10)

  Area Room Parking Warehouse Elevator
0   63    1       1         1        1
1   60    1       1         1        1
2   79    2       1         1        1
3   95    2       1         1        1
4  123    2       1         1        1
5   70    2       1         1        0
6   87    2       1         1        1
7   59    1       1         1        1
8   54    2       1         1        0
9   71    1       1         1        1